print("Завдання 2.")
print('Hello"world"!')
print("Hello'world'!")
print("Завдання 3.")
print("Привіт,красуня,як тебе звати?)")
name = input()
print('Як справи,' + name + '?')
a = input()
if 'Добре' in a:
    print('Я дуже радий за тебе')
elif 'Погано' in a:
    print('Мені шкода,не хвилюйся все буде чудово')
else:
    print("Пам'ятай що завжди за чорною смугою в житті йде біла!!!")
# Змінна імені використовується для того щоб програма змогла відтворити його після відповіді користувача
# А змінна настрою портібна для того щоб програма підходяще відповіла
print("Завдання 5.")
print("\"Привіт світ !\n Привіт ...!\n Що вставити замість зірочки? *відповідь користувача*\n Привіт *відповідь користувача*\"")
path = "D:\\ФІТ1-10\\Поліщук_Данило"
print(path)
path = "D:\ФІТ1-10\Поліщук_Данило"
print(path)
print('Завдання 6.')
print("Привіт світ !\n\t""Привіт знову!\n\t\t""Мені подобається це друкувати.\n\t\t\t""Ypa!\n\t\t\t\t""Я друкую!\n\t\t\t\t\t""Це весело!\n\t\t\t\t\t\t""Це заняття як 'диво' .\n\t\t\t\t\t\t\t""Я б 'сказав', що це круто!")
print("Завдання 7.")
print("1)")
a = 12+13
print(str(a))
s = 34-19
print(str(s))
d = 12*45
print(str(d))
f = 45/32
print(str(f))
g = 4**9
print(str(g))
print("2)")
a = 50+50
print("1)"+str(a))
s = 150-50
print("2)"+str(s))
d = 5*20
print("3)"+str(d))
f = 200/2
print("4)"+str(f))
g = 10**2
print("5)"+str(g))
print("3.")
print("Введіть перше число ")
a = int(input())
print("Введіть друге число")
b = int(input())
c = a + b
print("Сума ваших чисел = "+str(c))
print("Завдання 8.")
print("Привіт світ !\nПривіт знову!\nМені подобається це друкувати.\nYpa! Я друкую!\nЦе весело!\nЦе заняття як 'диво' .\n"  'Я б "сказав", що це круто! ')
print("Завдання 9.")
result = 105+384
print("1)"+str(result))
result = 122-21.5
print("2)"+str(result))
result = 5+10.0
print("3)"+str(result))
result = 25/7
print("4)"+str(result))
result = 25//7
print("5)"+str(result))
result = 5+(25%7)
print("6)"+str(result))
#(2**(4**(3+5**8))) - не рахується
result = 3**(2/5)
print("8)"+str(result))
print("9)")
зп = 4500
премія1 = 1200
премія2 = зп/100*10
премія3 = зп/100*15
премія4 = 2000
премії = премія1+премія2+премія3+премія4
лоторея = 500
податок = (зп+премії+лоторея)/100*18
збір = (зп+премії+лоторея)/100*1.5
весьдохід = зп+премії+лоторея
чп = весьдохід-податок-збір
print("Весь дохід = "+str(весьдохід)+" грн")
print("Премії = "+str(премії)+" грн")
print("Податок на дохід = 18% ="+str(податок)+" грн")
print("Військовий збір = 1.5% ="+str(збір)+" грн")
print("Чистий прибуток = "+str(чп)+" грн")
